## 2. Data Types

In [41]:
counter = 100.00 #float type variable
miles = 100 #integer type variable
name = "Mehvish" #string type variable
#print all values
print (counter)
print (miles)

100.0
100

In [43]:
2 #integer

2

In [5]:
2+3 #integer

5

In [7]:
 2.3+5.5 #float

7.8

In [9]:
2**2 #exponent

4

In [11]:
name = 'Mehvish'
university = "COMSATS"
print(name,university)

Mehvish COMSATS

In [13]:
stringVariable = 'Hello World'
print("stringVariable[0]:", stringVariable[0])
print("stringVariable[1:5]:", stringVariable[1:5])

stringVariable[0]: H
stringVariable[1:5]: ello

In [15]:
stringVariable = "Hello World"
stringVariable = stringVariable[:6] + "Python"
print("Updated string: ", stringVariable)

Updated string:  Hello Python

In [17]:
stringVariable = "Hello World"
print (stringVariable)
del stringVariable
print (stringVariable)

Hello World

NameError: name 'stringVariable' is not defined

 ''its shows error Because after first print we delete the stringvariable''

In [25]:
variable = "Hello"
print(variable+"Python")

HelloPython

In [27]:
 variable = "Hello"
print(variable*3)

HelloHelloHello

In [29]:
variable = "Hello"
print(variable[1])

e

In [31]:
variable = "Hello"
print(variable[1:3])

el

In [33]:
variable = "Hello"
print('H' in variable)

True

In [35]:
variable = "Hello"
print('G' not in variable)

True

In [37]:
print ("My name is %s and age is %d kg!" % ("Zara",21))

My name is Zara and age is 21 kg!

In [45]:
list1 = ['Mehvish','1880']
print(list1)

['Mehvish', '1880']

In [47]:
list1 = ['physics', 'chemistry', 1997, 2000];
list2 = [1, 2, 3, 4, 5, 6, 7 ];
print ("list1[0]: ", list1[0])
print ("list2[1:5]: ", list2[1:5])

list1[0]:  physics
list2[1:5]:  [2, 3, 4, 5]

In [49]:
list1 = ['physics', 'chemistry', 1997, 2000];
list1[1] = "computer science"
print(list1)
list1.append('Computer Science')
print(list1)

['physics', 'computer science', 1997, 2000]
['physics', 'computer science', 1997, 2000, 'Computer Science']

In [51]:
list1 = ['physics', 'chemistry', 1997, 2000];
print (list1)
del list1[2];
print ("After deleting value at index 2 : ")
print (list1)

['physics', 'chemistry', 1997, 2000]
After deleting value at index 2 :
['physics', 'chemistry', 2000]

In [53]:
 list1 = ['physics', 'chemistry', 1997, 2000];
print (list1)
list1.remove('chemistry')
print ("After deleting value at index 2 : ")
print (list1)

['physics', 'chemistry', 1997, 2000]
After deleting value at index 2 :
['physics', 1997, 2000]

In [55]:
dict = {'Name':"Mehvish", 'Depart': "BCS", 'Batch': 2014}
print (dict['Name'])

Mehvish

In [57]:
dict = {'Name':"Mehvish", 'Depart': "BCS", 'Batch': 2014}
print (dict)
dict['Batch'] = "SP14"
print (dict)
dict['University'] = "COMSATS"
print(dict)

{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 2014}
{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 'SP14'}
{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 'SP14', 'University': 'COMSATS'}

In [59]:
dict = {'Name':"Mehvish", 'Depart': "BCS", 'Batch': 2014}
print (dict)
del dict['Batch']
print (dict)

{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 2014}
{'Name': 'Mehvish', 'Depart': 'BCS'}

In [61]:
 dict = {'Name':"Mehvish", 'Depart': "BCS", 'Batch': 2014}
dict.clear()
print (dict)

{}

In [63]:
tup = ('Math','98', 'C programming', '99')
print (tup)
print(tup[1])
print(tup[1:3])

('Math', '98', 'C programming', '99')
98
('98', 'C programming')

In [65]:
tup1 = (12, 34.56);
tup2 = ('abc', 'xyz');
#Following action is not valid for tuples
#tup1[0] = 100;
#So let's create a new tuple as follows
tup3 = tup1 + tup2;
print (tup3);

(12, 34.56, 'abc', 'xyz')

In [67]:
 tup = ('physics', 'chemistry', 1997, 2000);
print (tup);
del tup;
print ("After deleting tup : ");
print (tup);

('physics', 'chemistry', 1997, 2000)
After deleting tup :

NameError: name 'tup' is not defined

After first print we delete the tuple

In [70]:
#list
list1 = [1,2,3,4,5]
print (type(list1))
my_set = set(list1)
print(my_set) print
(type(my_set))
#set of integers
my_set = {1,2,3}
print (my_set)
#set of mixed data types
my_set = {1,"Hello", 1.2,'C'}
#adding a single value
my_set.add('D')
#adding multiple values
my_set.update(list1)
print (my_set)
my_set.discard('G') # it will not raise an error
my_set.remove('G') # it will raise an error

SyntaxError: invalid syntax (1209854363.py, line 5)

my_set.discard('G') , not raise an error if the element is missing.

my_set.remove('G') , Because 'G' is not present in the set, and remove() raises a KeyError

# 3. Comparison Operators

In [73]:
1<3

True

In [75]:
15 <= 23

True

In [77]:
'Mehvish' == "Zeenat"

False

In [79]:
"Mehvish" != "Mehvish"

False

In [81]:
(1==1)or(5>2)

True

In [83]:
 (1<2)and(2<1)

False

# 4. If-Else Statements

In [90]:
if 25 % 2:
     print('Even')
else:
     print('Odd')

Even

# 5. For and While Loop

In [94]:
#example of for loop
fact = 1
N = 5
for i in range (1,N+1):
       fact*=i
print (fact)

120

In [96]:
#example of while loop
a = 0
while a < 10:
      a = a+1
print(a)

10

# 6. Functions

In [98]:
 # Function definition is here
def printme( str ):
#This prints a passed string into this function
        print (str)
        return;
# Now you can call printme function
printme("I'm first call to user defined function!")

I'm first call to user defined function!

# 7. Lambda Functions

In [104]:
 #Normal function
def f (x):
    return x**2
print (f(8))

64

In [106]:
#Lambda Function
#lambda expressions
times3 = lambda var:var*3
times3(10)
#lambda expressions: another way to write a function in line

30

In [110]:
sentence = 'It is raining cats and dogs'
words = sentence.split()
print (words)

lengths = map(lambda word: len(word), words)
list(lengths)

['It', 'is', 'raining', 'cats', 'and', 'dogs']

[2, 2, 7, 4, 3, 4]

In [113]:
fib = [0,1,1,2,3,5,8,13,21,34,55]
result1 = filter(lambda x: x % 2, fib)
list(result1)

[1, 1, 3, 5, 13, 21, 55]

In [115]:
fib = [0,1,1,2,3,5,8,13,21,34,55]
result2 = filter(lambda x: x % 2 == 0, fib)
list (result2)

[0, 2, 8, 34]

# 8. File I/O

In [120]:
 from six.moves import input
string = input("Enter your name: ");
print(string)

Enter your name:  Shahzaib

Shahzaib

In [136]:
# Open a file to read
fileOpen = open("file.txt", "r+")
str = fileOpen.read(); #to read specific content from start you can use read(12). It will read 12 characters from the start of file
print (str)
# Close opend file
fileOpen.close()

Shahzaib

In [142]:
# Open a file to append
fileOpen = open("file.txt", "a+")
fileOpen.write(" Information Technology Lahore");
fileOpen.close()
# Open a file to read
fileOpen = open("file.txt", "r+")
string = fileOpen.read(); #to read specific content from start you can use read(12). It will read 12 characters from the start of file
print (string)
# Close opend file
fileOpen.close()

Shahzaib
BS Information Technology Lahore

In [144]:
# Open a file
fo = open("file.txt", "r+")
str = fo.read(10);
print("ReadStringis:\n",str)
# Check current position
position = fo.tell();
print("Currentfileposition:\n", position)
#Repositionpointeratthebeginning once again
position = fo.seek(0, 0);
str = fo.read(10);
print("AgainreadStringis:\n", str)
# Close opend file
fo.close()

ReadStringis:
 Shahzaib
B
Currentfileposition:
 11
AgainreadStringis:
 Shahzaib
B

In [146]:
import os
# renameafile
os.rename("file.txt","newfile.txt")

In [148]:
#remove file
os.remove("newfile.txt")

# 9. Panda 
# 10.Series

In [151]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
"""following a fucntion is called from panas to create a series.
data would be 5 random values and indexes are assigned a-e"""
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
s

a   -0.270733
b    1.698893
c   -0.572403
d    0.393570
e   -0.115532
dtype: float64

In [153]:
 """Following function will print the index and its datatype"""
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [155]:
""" In following example, indexes are not given to it is constructed from the sorted keys of the dict"""
d = {'a' : 0., 'b' : 1., 'c' : 2.} # a python dict
pd.Series(d)

a    0.0
b    1.0
c    2.0
dtype: float64

In [157]:
""" In following example, index are given, so the values in data corresponding in the index will be pulled ou
t"""
pd.Series(d, index=['b', 'c', 'd', 'a'])

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

In [159]:
"""In following example, a scalar value is given as data so it will be repeated to match the length of inde
x"""
pd.Series(5., index=['a', 'b', 'c', 'd', 'e'])

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

In [161]:
#we can access a value just like ndarray
#access single value
s[0]

C:\Users\Shahzaib\AppData\Local\Temp\ipykernel_6180\2232011024.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[0]

-0.27073312406757755

In [163]:
#access range of values
s[:5]

a   -0.270733
b    1.698893
c   -0.572403
d    0.393570
e   -0.115532
dtype: float64

In [165]:
""" Following example will return a range of values in series whose value is greater than the median of serie
s"""
s[s > s.median()]

b    1.698893
d    0.393570
dtype: float64

In [167]:
"""Following example is return the values in series with indexes. 4,3,1 are the positions of the indexs
For example: the index at 4,3,1 are e,d,b respectively"""
s[[4, 3, 1]]

C:\Users\Shahzaib\AppData\Local\Temp\ipykernel_6180\286164160.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[[4, 3, 1]]

e   -0.115532
d    0.393570
b    1.698893
dtype: float64

In [169]:
 """ Following example returns the exponent values. just like e^a (here a is index and its respective data is
placed here)"""
np.exp(s)

a    0.762820
b    5.467890
c    0.564168
d    1.482262
e    0.890892
dtype: float64

In [171]:
"""Following example will get the data of given index"""
s['a']

-0.27073312406757755

In [173]:
"""Following example will update the data of the given index"""
s['e'] = 12.
s # before updating e = 1.399281 but after updating e = 12.000000

a    -0.270733
b     1.698893
c    -0.572403
d     0.393570
e    12.000000
dtype: float64

In [175]:
""" Following will return true if 'e' is in the values of index otherwise false"""
'e' in s

True

In [177]:
"""If a label is not contained and you are trying to access its data, an exception is raised: """
s['f']
# This will create error

KeyError: 'f'

shows error because label 'f' does not exist in the Series s.

In [182]:
"""Using the get method, a missing label will return None or specified default"""
s.get('f') #it will return none
s.get('f', np.nan) #it will return default value

nan

In [184]:
"""following will add the data of respective values of indexes. For example, in given output, it is calculate
d as: a = s['a'] +
s['a'] b = s['b'] +
s['b'] c = s['c'] +
s['c'] d = s['d'] +
s['d'] e = s['e'] +
s['e']
"""
s + s

a    -0.541466
b     3.397785
c    -1.144806
d     0.787139
e    24.000000
dtype: float64

In [186]:
"""following will multiply the data of each values of indexes, with 2. For example, in given output, it is ca
lculated as:
a = s['a'] *2
b = s['b'] *2
c = s['c'] *2
d = s['d'] *2
e = s['e'] *2"""
s * 2

a    -0.541466
b     3.397785
c    -1.144806
d     0.787139
e    24.000000
dtype: float64

In [188]:
s = pd.Series(np.random.randn(5), name='something')
s

0    0.235606
1   -0.490452
2    0.728155
3    0.673843
4   -1.439389
Name: something, dtype: float64

In [190]:
s.name #print the name attribute of series

'something'

In [193]:
#rename the series name attribute and assign to s2 object. Note that s and s2 refer to different objects.
s2 = s.rename("different")
s2.name

'different'

# 11. Data Frames

In [198]:
""" A dict is created """
d = {
'one' : pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
'two' : pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])
}
"""create a dataframe. row label will be the indes of a series. As coloum labels are not given so it
will be sorted list of dict keys"""
df=pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [200]:
""" a data frame will be constructed for given row labels"""
pd.DataFrame(d, index=['d', 'b', 'a'])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [202]:
"""following example shows a data frame when we give coloumn labels"""
pd.DataFrame(d, index=['d', 'b', 'a'], columns=['two', 'three'])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

In [204]:
df.columns

Index(['one', 'two'], dtype='object')

In [206]:
"""followind examples shows that ndarray has same length"""
d = {
'one' : [1., 2., 3., 4.],
'two' : [4., 3., 2., 1.]
}

In [208]:
"""If indexs are given then it would be same length as arrays"""
pd.DataFrame(d, index=['a', 'b', 'c', 'd'])

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

In [210]:
 """constructing data frame from a list of dicts"""
data2 = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
pd.DataFrame(data2)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [212]:
 """passing list of dicts as data and indexes (row labels)"""
pd.DataFrame(data2, index=['first', 'second'])

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [214]:
"""passing list of dicts as data and columns (columns labels)"""
pd.DataFrame(data2, columns=['a', 'b'])

   a   b
0  1   2
1  5  10

In [216]:
pd.DataFrame({('a', 'b'): {('A', 'B'): 1, ('A', 'C'): 2},
('a', 'a'): {('A', 'C'): 3, ('A', 'B'): 4},
('a', 'c'): {('A', 'B'): 5, ('A', 'C'): 6},
('b', 'a'): {('A', 'C'): 7, ('A', 'B'): 8},
('b', 'b'): {('A', 'D'): 9, ('A', 'B'): 10}})
#"NaN shows missing data

       a              b
       b    a    c    a     b
A B  1.0  4.0  5.0  8.0  10.0
  C  2.0  3.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

In [218]:
data = np.zeros((2,), dtype=[('A', 'i4'),('B', 'f4'),('C', 'a10')])
data

array([(0, 0., b''), (0, 0., b'')],
      dtype=[('A', '<i4'), ('B', '<f4'), ('C', 'S10')])

In [226]:
pd.DataFrame.from_records(data, index='C')

     A    B
C
b''  0  0.0
b''  0  0.0

In [230]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
print(df)

   A  B
0  1  4
1  2  5
2  3  6

In [242]:
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame.from_dict(data, orient='index', columns=['one', 'two', 'three'])
print(df)

   one  two  three
A    1    2      3
B    4    5      6

In [244]:
df['one'] # it is displaying data under coloumn 'one'

A    1
B    4
Name: one, dtype: int64

In [246]:
df['three'] = df['one'] * df['two'] # assigning values to a colomn named 'three' after calculation

In [248]:
 df['flag'] = df['one'] > 2 #check if value at column 'one' is > 2 then assign True otherwise false

In [250]:
 df #print a complete data frame

   one  two  three   flag
A    1    2      2  False
B    4    5     20   True

In [252]:
del df['two'] #delete a coloumn 'two' from data frame

In [254]:
three = df.pop('three') #pop a complete coloumn 'three' from dataframe

In [256]:
df

   one   flag
A    1  False
B    4   True

In [258]:
df['foo'] = 'bar' #a coloumn 'foo' will be populated with 'bar'

In [260]:
df

   one   flag  foo
A    1  False  bar
B    4   True  bar

In [262]:
"""following example will take values from coloumn one until give range and will populate the new coloumn"""
df['one_trunc'] = df['one'][:2]

In [264]:
df

   one   flag  foo  one_trunc
A    1  False  bar          1
B    4   True  bar          4

In [266]:
"""following function has three arguments.
First argument: index where new coloumn will be inserted.
Second argument: label or title of a new coloumn
Third argument: it will create a coloumn at specified position"""
df.insert(1, 'bar2', df['one'])

In [283]:
df

          A         B         C         D
0  0.616486 -1.334718  1.529231  0.842195
1 -0.048407  0.207938  2.822052  0.681856
2 -0.366068  0.184808 -0.208420  0.907698
3  1.254615  0.824373  0.357837 -1.348405
4  0.479829  0.156915 -1.290546  0.976857
5 -0.964573  1.235992  2.492236 -0.989369
6  0.285100  1.180833  0.366589  0.094721
7 -0.977490  0.619442 -1.359105  0.686598
8  0.573547  1.138470 -0.523836  0.389388
9 -0.426465  0.431377 -0.291198 -0.395528

In [287]:
df.iloc[2] #it will return the values of those coloumns that is > than 2

A   -0.366068
B    0.184808
C   -0.208420
D    0.907698
Name: 2, dtype: float64

In [289]:
df = pd.DataFrame(np.random.randn(10, 4), columns=['A', 'B', 'C', 'D'])

In [291]:
df2 = pd.DataFrame(np.random.randn(7, 3), columns=['A', 'B', 'C'])

In [293]:
df + df2 # add values of respective coloumn labels

          A         B         C   D
0  1.409662 -0.664595  0.166269 NaN
1  2.006308  1.223349 -1.213822 NaN
2 -0.071799 -0.148830  0.554656 NaN
3 -1.627700  0.167236 -0.062058 NaN
4 -0.206223  0.957899  0.563073 NaN
5 -2.437565 -2.259486 -0.824948 NaN
6  0.270124  0.156000  0.931532 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

In [295]:
df - df.iloc[0]

          A         B         C         D
0  0.000000  0.000000  0.000000  0.000000
1  0.131911  1.470441 -0.304702 -0.800527
2 -1.546851  0.313082  1.145035  1.579277
3 -2.372839  1.739668  0.269529  0.724133
4 -1.162490  0.425594  0.480682 -0.305452
5 -2.347258 -1.594050 -0.044684 -0.147554
6 -0.724446  0.080308  0.651840  1.185382
7  0.156044  2.182103  0.900285 -1.103771
8 -2.949824  1.940466 -0.808687  0.421473
9 -1.672636  2.469656  0.315092  0.911958

In [297]:
df*5+2

           A          B         C         D
0   9.374971  -1.221674  1.347187  1.803340
1  10.034526   6.130529 -0.176321 -2.199297
2   1.640714   0.343736  7.072364  9.699727
3  -2.489226   7.476664  2.694832  5.424004
4   3.562521   0.906298  3.750599  0.276082
5  -2.361318  -9.191925  1.123767  1.065572
6   5.752742  -0.820132  4.606387  7.730252
7  10.155191   9.688840  5.848614 -3.715515
8  -5.374150   8.480654 -2.696250  3.910703
9   1.011790  11.126608  2.922647  6.363133

In [299]:
1 / df

           A         B         C          D
0   0.677969 -1.551988 -7.659161 -25.424619
1   0.622314  1.210499 -2.297456  -1.190675
2 -13.916500 -3.018843  0.985734   0.649374
3  -1.113778  0.912965  7.195985   1.460279
4   3.199956 -4.571628  2.856165  -2.900370
5  -1.146442 -0.446751 -5.706246  -5.350865
6   1.332359 -1.772967  1.918365   0.872562
7   0.613106  0.650293  1.299169  -0.874812
8  -0.678044  0.771527 -1.064679   2.616838
9  -5.059651  0.547849  5.419188   1.145966

In [301]:
df **4

          A          B         C         D
0  4.733270   0.172364  0.000291  0.000002
1  6.667469   0.465739  0.035893  0.497538
2  0.000027   0.012040  1.059160  5.623690
3  0.649839   1.439409  0.000373  0.219916
4  0.009537   0.002289  0.015027  0.014131
5  0.578883  25.103777  0.000943  0.001220
6  0.317333   0.101204  0.073837  1.725102
7  7.077118   5.591949  0.351024  1.707424
8  4.731163   2.822249  0.778260  0.021325
9  0.001526  11.100884  0.001159  0.579847

In [303]:
df1 = pd.DataFrame({'a' : [1, 0, 1], 'b' : [0, 1, 1] }, dtype=bool)

In [305]:
df2 = pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)

In [307]:
pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)

       a      b
0  False   True
1   True   True
2   True  False

In [309]:
df1 & df2 #and logical operator

       a      b
0  False  False
1  False   True
2   True  False

In [311]:
df1 | df2 # or operator

      a     b
0  True  True
1  True  True
2  True  True

In [313]:
-df1

       a      b
0  False   True
1   True  False
2  False  False

In [315]:
# only show the first 5 rows
df[:5].T

          0         1         2         3         4
A  1.474994  1.606905 -0.071857 -0.897845  0.312504
B -0.644335  0.826106 -0.331253  1.095333 -0.218740
C -0.130563 -0.435264  1.014473  0.138966  0.350120
D -0.039332 -0.839859  1.539945  0.684801 -0.344784

In [317]:
dates = pd.date_range('20130101', periods=6)

In [319]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [321]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [323]:
df

                   A         B         C         D
2013-01-01  0.947153  1.758789  1.366483  1.839390
2013-01-02 -0.846396 -1.225437 -2.220782 -1.559652
2013-01-03 -1.388353  1.180077  0.072255  0.293132
2013-01-04  0.294944  1.954521 -1.928209  0.975530
2013-01-05 -1.528605  0.588685 -0.002527 -1.400321
2013-01-06 -2.835337  0.309922 -0.291958 -0.086227

In [325]:
df2 = pd.DataFrame({ 'A' : 1.,
'B' : pd.Timestamp('20130102'),
'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
'D' : np.array([3] * 4,dtype='int32'),
'E' : pd.Categorical(["test","train","test","train"]),
'F' : 'foo' })

In [327]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [329]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

# 11. Viewing Data

In [331]:
df.head() #display first 5 records

                   A         B         C         D
2013-01-01  0.947153  1.758789  1.366483  1.839390
2013-01-02 -0.846396 -1.225437 -2.220782 -1.559652
2013-01-03 -1.388353  1.180077  0.072255  0.293132
2013-01-04  0.294944  1.954521 -1.928209  0.975530
2013-01-05 -1.528605  0.588685 -0.002527 -1.400321

In [333]:
df.tail(3) #display last 3 records

                   A         B         C         D
2013-01-04  0.294944  1.954521 -1.928209  0.975530
2013-01-05 -1.528605  0.588685 -0.002527 -1.400321
2013-01-06 -2.835337  0.309922 -0.291958 -0.086227

In [335]:
df.index #display indexes

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [337]:
df.columns #display coloumns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [339]:
df.values # print values

array([[ 9.47153038e-01,  1.75878896e+00,  1.36648287e+00,
         1.83939040e+00],
       [-8.46396384e-01, -1.22543708e+00, -2.22078196e+00,
        -1.55965155e+00],
       [-1.38835294e+00,  1.18007697e+00,  7.22548019e-02,
         2.93131518e-01],
       [ 2.94943761e-01,  1.95452133e+00, -1.92820852e+00,
         9.75530432e-01],
       [-1.52860549e+00,  5.88684844e-01, -2.52682423e-03,
        -1.40032101e+00],
       [-2.83533696e+00,  3.09921587e-01, -2.91958349e-01,
        -8.62270030e-02]])

In [341]:
# Transposing your data
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.947153   -0.846396   -1.388353    0.294944   -1.528605   -2.835337
B    1.758789   -1.225437    1.180077    1.954521    0.588685    0.309922
C    1.366483   -2.220782    0.072255   -1.928209   -0.002527   -0.291958
D    1.839390   -1.559652    0.293132    0.975530   -1.400321   -0.086227

In [343]:
#Sorting by an axis
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.839390  1.366483  1.758789  0.947153
2013-01-02 -1.559652 -2.220782 -1.225437 -0.846396
2013-01-03  0.293132  0.072255  1.180077 -1.388353
2013-01-04  0.975530 -1.928209  1.954521  0.294944
2013-01-05 -1.400321 -0.002527  0.588685 -1.528605
2013-01-06 -0.086227 -0.291958  0.309922 -2.835337

In [345]:
#Sorting by values
df.sort_values(by='B')

                   A         B         C         D
2013-01-02 -0.846396 -1.225437 -2.220782 -1.559652
2013-01-06 -2.835337  0.309922 -0.291958 -0.086227
2013-01-05 -1.528605  0.588685 -0.002527 -1.400321
2013-01-03 -1.388353  1.180077  0.072255  0.293132
2013-01-01  0.947153  1.758789  1.366483  1.839390
2013-01-04  0.294944  1.954521 -1.928209  0.975530

In [347]:
# Describe shows a quick statistic summary of your data
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.892766  0.761093 -0.500790  0.010309
std    1.358056  1.164027  1.349286  1.328243
min   -2.835337 -1.225437 -2.220782 -1.559652
25%   -1.493542  0.379612 -1.519146 -1.071798
50%   -1.117375  0.884381 -0.147243  0.103452
75%    0.009609  1.614111  0.053559  0.804931
max    0.947153  1.954521  1.366483  1.839390

In [349]:
#Selecting a single column, which yields a Series, equivalent to df.A
df['A']

2013-01-01    0.947153
2013-01-02   -0.846396
2013-01-03   -1.388353
2013-01-04    0.294944
2013-01-05   -1.528605
2013-01-06   -2.835337
Freq: D, Name: A, dtype: float64

In [351]:
#Selecting via [], which slices the rows.
df[0:3]

                   A         B         C         D
2013-01-01  0.947153  1.758789  1.366483  1.839390
2013-01-02 -0.846396 -1.225437 -2.220782 -1.559652
2013-01-03 -1.388353  1.180077  0.072255  0.293132

In [353]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.846396 -1.225437 -2.220782 -1.559652
2013-01-03 -1.388353  1.180077  0.072255  0.293132
2013-01-04  0.294944  1.954521 -1.928209  0.975530

In [355]:
#Selecting on a multi-axis by label
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.947153  1.758789
2013-01-02 -0.846396 -1.225437
2013-01-03 -1.388353  1.180077
2013-01-04  0.294944  1.954521
2013-01-05 -1.528605  0.588685
2013-01-06 -2.835337  0.309922

In [357]:
#Showing label slicing, both endpoints are included
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.846396 -1.225437
2013-01-03 -1.388353  1.180077
2013-01-04  0.294944  1.954521

In [359]:
# Reduction in the dimensions of the returned object
df.loc['20130102',['A','B']]

A   -0.846396
B   -1.225437
Name: 2013-01-02 00:00:00, dtype: float64

In [361]:
 # For getting a scalar value
df.loc[dates[0],'A']

0.9471530383067611

In [363]:
# For getting fast access to a scalar
df.at[dates[0],'A']

0.9471530383067611

In [365]:
# Select via the position of the passed integers
df.iloc[3]

A    0.294944
B    1.954521
C   -1.928209
D    0.975530
Name: 2013-01-04 00:00:00, dtype: float64

In [367]:
# By integer slices, acting similar to numpy/python
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.294944  1.954521
2013-01-05 -1.528605  0.588685

In [369]:
# By lists of integer position locations, similar to the numpy/python style
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.846396 -2.220782
2013-01-03 -1.388353  0.072255
2013-01-05 -1.528605 -0.002527

In [371]:
# For slicing rows explicitly
df.iloc[:,1:3]

                   B         C
2013-01-01  1.758789  1.366483
2013-01-02 -1.225437 -2.220782
2013-01-03  1.180077  0.072255
2013-01-04  1.954521 -1.928209
2013-01-05  0.588685 -0.002527
2013-01-06  0.309922 -0.291958

In [373]:
 # For getting a value explicitly
df.iloc[1,1]

-1.2254370774913659

In [375]:
# Using a single column’s values to select data.
df[df.A > 0]

                   A         B         C        D
2013-01-01  0.947153  1.758789  1.366483  1.83939
2013-01-04  0.294944  1.954521 -1.928209  0.97553

In [377]:
# Selecting values from a DataFrame where a boolean condition is met.
df[df > 0]

                   A         B         C         D
2013-01-01  0.947153  1.758789  1.366483  1.839390
2013-01-02       NaN       NaN       NaN       NaN
2013-01-03       NaN  1.180077  0.072255  0.293132
2013-01-04  0.294944  1.954521       NaN  0.975530
2013-01-05       NaN  0.588685       NaN       NaN
2013-01-06       NaN  0.309922       NaN       NaN

In [379]:
# Using the isin() method for filtering:
df2 = df.copy()

In [381]:
df2['E'] = ['one', 'one','two','three','four','three']

In [383]:
df2

                   A         B         C         D      E
2013-01-01  0.947153  1.758789  1.366483  1.839390    one
2013-01-02 -0.846396 -1.225437 -2.220782 -1.559652    one
2013-01-03 -1.388353  1.180077  0.072255  0.293132    two
2013-01-04  0.294944  1.954521 -1.928209  0.975530  three
2013-01-05 -1.528605  0.588685 -0.002527 -1.400321   four
2013-01-06 -2.835337  0.309922 -0.291958 -0.086227  three

In [385]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -1.388353  1.180077  0.072255  0.293132   two
2013-01-05 -1.528605  0.588685 -0.002527 -1.400321  four